module.exports = {
	// يمكنك تخصيص اللغة هنا أو مباشرة داخل ملفات الأوامر
	autoUpdateThreadInfo: {},
	checkwarn: {
		text: {
			warn: "تم تحذير العضو %1 ثلاث مرات مسبقًا، ولذلك تم حظره من المجموعة.\n- الاسم: %1\n- معرف المستخدم: %2\n- لإلغاء الحظر، استخدم الأمر \"%3warn unban <uid>\" (حيث uid هو معرف الشخص الذي تريد إلغاء حظره).",
			needPermission: "يحتاج البوت إلى صلاحية المشرف لطرد الأعضاء المحظورين."
		}
	},
	leave: {
		text: {
			session1: "الصباح",
			session2: "الظهيرة",
			session3: "العصر",
			session4: "المساء",
			leaveType1: "غادر المجموعة",
			leaveType2: "تمت إزالته من المجموعة"
		}
	},
	logsbot: {
		text: {
			title: "====== سجلات البوت ======",
			added: "\n✅\nالحدث: تمت إضافة البوت إلى مجموعة جديدة.\n- تمت الإضافة بواسطة: %1",
			kicked: "\n❌\nالحدث: تم طرد البوت من المجموعة.\n- تم الطرد بواسطة: %1",
			footer: "\n- معرف المستخدم: %1\n- اسم المجموعة: %2\n- معرف المجموعة: %3\n- الوقت: %4"
		}
	},
	onEvent: {},
	welcome: {
		text: {
			session1: "الصباح",
			session2: "الظهيرة",
			session3: "العصر",
			session4: "المساء",
			welcomeMessage: "شكرًا لإضافتي إلى المجموعة!\nبادئة البوت: %1\nلعرض قائمة الأوامر، اكتب: %1help",
			multiple1: "أنت",
			multiple2: "أنتم جميعًا"
		}
	}
};
